sensorOpt/con/12.0_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       223187;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       223587;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       223787;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       224187;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          111706;
        startFace       224387;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          111706;
        startFace       336093;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          317;
        startFace       447799;
    }
)

// ************************************************************************* //
